app/Views/templates/adminlte_template.php

SELECT *
FROM `tbl_notifikasi`
WHERE `notifikasi_user_id` = '1'
ORDER BY `notifikasi_tanggal` DESC
 LIMIT 5
SELECT *
FROM `tbl_notifikasi`
WHERE `notifikasi_user_id` = '1'
ORDER BY `notifikasi_tanggal` DESC
---
        <?php
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_notifikasi');
        $notifikasi   = $builder->where('notifikasi_user_id', session()->get('id_user'))->orderBy('notifikasi_tanggal', 'DESC')->limit(5)->get()->getResult();
        $jumlahNotifikasi = $builder->where('notifikasi_user_id', session()->get('id_user'))->orderBy('notifikasi_tanggal', 'DESC')->get()->getResult()