app/Controllers/BarangMasuk.php

SELECT *
FROM `tbl_permintaan`
ORDER BY `tanggal` DESC
SELECT *
FROM `tbl_supplier`
WHERE `tbl_supplier`.`kode_supplier` = '4'
SELECT *
FROM `tbl_permintaan_detail`
LEFT JOIN `tbl_satuan_barang` ON `tbl_satuan_barang`.`satuan_barang_id` = `tbl_permintaan_detail`.`satuan_barang_id`
SELECT *
FROM `tbl_barang`
LEFT JOIN `tbl_satuan_barang` ON `tbl_satuan_barang`.`satuan_barang_id` = `tbl_barang`.`satuan`
WHERE `tbl_barang`.`kode_barang` = 'BRG0008'
---
    function barang_masuk_add()
    {
        $pesanan = $this->permintaanModel->orderBy('tanggal', 'DESC')->findAll();
        foreach ($pesanan as $data) {
            if ($data['status'] == 'approved' && $data['proses'] == '0') {
                $supplier = $this->supplierModel->find($data['kode_supplier']);
                $permintaan[] = [
                    'no_pesanan' => $data['kode_pesanan'],
                    'supplier' => $supplier['kode_supplier']
                ];

                $detail_pesanan = $this->permintaanDetailModel
                    ->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_permintaan_detail.satuan_barang_id', 'left')
                    ->findAll();
                foreach ($detail_pesanan as $detail) {
                    if ($data['id'] == $detail['id_permintaan']) {
                        $barang = $this->barangModel
                            ->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_barang.satuan', 'left')
                            ->find($detail['kode_barang']);

SELECT *
FROM `tbl_satuan_barang`
---
            }
        }

        $satuan_barang = $this->satuanBarangModel->findAll();