app/Controllers/BaseController.php

    function sendNotification($id_user, $judul, $pesan, $url)
    {
        $today = date('Y-m-d H:i:s');
        $builder = $this->db->table('tbl_notifikasi');

        $builder->insert([
            'notifikasi_user_id' => $id_user,
            'notifikasi_judul' => $judul,
            'notifikasi_pesan' => $pesan,
            'notifikasi_url' => $url,
            'notifikasi_tanggal' => $today,
        ]);
---
INSERT INTO `tbl_notifikasi` (`notifikasi_user_id`, `notifikasi_judul`, `notifikasi_pesan`, `notifikasi_url`, `notifikasi_tanggal`) VALUES (2, 'Operasional', 'Pesanan Barang menunggu konfirmasi atasan', '/cek-pesanan', '2022-08-11 00:13:10')