app/Controllers/Dashboard.php

SELECT *
FROM `tbl_barang`
SELECT *
FROM `tbl_penjualan_barang`
---
    public function index()
    {
        // Stok Habis
        $db_barang = $this->barangModel->findAll();
        if ($db_barang != []) {
            foreach ($db_barang as $barang) {
                if ($barang['stok'] < $barang['stok_minimum']) {
                    $stokBarang[] = $barang;
                }
            }
        }
        $barangHabis = [
            'count' => (isset($stokBarang)) ? count($stokBarang) : 0,
            'title' => 'Stok Hampir Habis'
        ];

        // Barang Keluar
        $totalTerpakai = 0;
        $tgl_resep = $this->penjualanBarangModel->findAll();

SELECT *
FROM `tbl_pembelian`
---

        // Barang Masuk
        $totalMasuk = 0;
        $tgl_masuk = $this->pembelianModel->findAll();

SELECT *
FROM `tbl_barang`
LEFT JOIN `tbl_satuan_barang` ON `tbl_satuan_barang`.`satuan_barang_id` = `tbl_barang`.`satuan`
LEFT JOIN `tbl_jenis_barang` ON `tbl_jenis_barang`.`jenis_barang_id` = `tbl_barang`.`jenis_barang`
ORDER BY `kode_barang` ASC
---
    public function penjualan_barang()
    {
        $data_penjualan = $this->penjualanBarangModel->orderBy('id_transaksi', 'ASC')->findAll();
        $barang_barangan = $this->barangModel
            ->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_barang.satuan', 'left')
            ->orderBy('kode_barang', 'ASC')
            ->findAll();

SELECT *
FROM `tbl_permintaan`
ORDER BY `tanggal` DESC
SELECT *
FROM `tbl_supplier`
ORDER BY `nama_supplier` ASC
SELECT *
FROM `tbl_permintaan_detail`
LEFT JOIN `tbl_satuan_barang` ON `tbl_satuan_barang`.`satuan_barang_id` = `tbl_permintaan_detail`.`satuan_barang_id`
---
    public function pesanan_barang()
    {
        return view('dashboard/pesanan_barang', [
            'title' => 'Pengajuan Barang',
            'card_title' => 'Pengajuan Barang',
            'navLink' => 'pengajuan-barang',
            'permintaan_barang' => $this->permintaanModel->orderBy('tanggal', 'DESC')->findAll(),
            'supplier' => $this->supplierModel->orderBy('nama_supplier', 'ASC')->findAll(),
            'detailBarang' => $this->permintaanDetailModel->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_permintaan_detail.satuan_barang_id', 'left')->findAll(),