app/Controllers/Dashboard.php

SELECT *
FROM `tbl_jenis_barang`
ORDER BY `updated_at` ASC
---
    public function jenis_barang()
    {
        $jenis_barang = $this->jenisBarangModel->orderBy('updated_at', 'DESC')->findAll();