app/Controllers/Laporan.php

    function laporan_stok_barang()
    {
        $reqGet = $this->request->getGet();
        if (isset($reqGet['periode']) && $this->stokBarangModel->findAll() != []) {
            foreach ($this->stokBarangModel->findAll() as $stok) {
                $to_barang = $this->barangModel
                    ->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_barang.satuan', 'left')
                    ->find($stok['kode_barang']);
                $date = date("Y-m-d", strtotime($stok['tanggal']));
                if ($date >= $reqGet['start_date'] && $date <= $reqGet['end_date']) {
                    $getPeriode[] = [
                        'kode_barang' => isset($to_barang) ? $to_barang['kode_barang'] : '',
                        'nama_barang' => isset($to_barang) ? $to_barang['nama_barang'] : '',
                        'satuan' => isset($to_barang) ? $to_barang['satuan_barang_name'] : '',
                        'stok_awal' => $stok['stok_awal'] != null ? $stok['stok_awal'] : 0,
                        'stok_masuk' => $stok['stok_masuk'] != null ? $stok['stok_masuk'] : 0,
                        'stok_keluar' => $stok['stok_keluar'] != null ? $stok['stok_keluar'] : 0,
                        'stok_akhir' => $stok['stok_akhir'] != null ? $stok['stok_akhir'] : 0
                    ];
                } else {
                    $getPeriode = [];
                }
            }
        } else if (isset($reqGet['day']) && $this->stokBarangModel->findAll() != []) {
            foreach ($this->stokBarangModel->findAll() as $stok) {
                $to_barang = $this->barangModel
                    ->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_barang.satuan', 'left')
                    ->find($stok['kode_barang']);
---
SELECT *
FROM `tbl_stok_barang`
SELECT *
FROM `tbl_barang`
LEFT JOIN `tbl_satuan_barang` ON `tbl_satuan_barang`.`satuan_barang_id` = `tbl_barang`.`satuan`
WHERE `tbl_barang`.`kode_barang` = 'GFK0002'