app/Controllers/PesananBarang.php

SELECT *
FROM `tbl_permintaan`
ORDER BY `tanggal` DESC
SELECT *
FROM `tbl_supplier`
ORDER BY `nama_supplier` ASC
---
    function cekPesanan()
    {
        return view('dashboard/cek_pesanan', [
            'title' => 'Cek Pengajuan Pemesanan',
            'card_title' => 'Cek Pengajuan Pemesanan',
            'navLink' => 'cek-pesanan',
            'permintaan_barang' => $this->permintaanModel->orderBy('tanggal', 'DESC')->findAll(),
            'data_supplier' => $this->supplierModel->orderBy('nama_supplier', 'ASC')->findAll()

SELECT *
FROM `tbl_permintaan`
ORDER BY `kode_pesanan` ASC
SELECT `kode_barang`, `nama_barang`, `stok`, `stok_minimum`, `satuan_barang_id` AS `satuan_beli_id`, `satuan_barang_name` AS `satuan_beli`, `harga_beli`, `harga_jual`
FROM `tbl_barang`
LEFT JOIN `tbl_satuan_barang` ON `tbl_satuan_barang`.`satuan_barang_id` = `tbl_barang`.`satuan_beli`
ORDER BY `kode_barang` ASC
---
    public function pesananAdd()
    {
        $permintaan_barang = $this->permintaanModel->orderBy('kode_pesanan', 'ASC')->findAll();
        if ($permintaan_barang != []) {
            foreach ($permintaan_barang as $pesanan) {
                $lastId = $pesanan['id'];
            }
            $no_pemesanan = "P" . date("Y") . date("m") . sprintf("%05d", $lastId + 1);
        } else {
            $no_pemesanan = "P" . date("Y") . date("m") . sprintf("%05d", 1);
        }

        $data_barang = $this->barangModel->orderBy('kode_barang', 'ASC')
            ->join('tbl_satuan_barang', 'tbl_satuan_barang.satuan_barang_id = tbl_barang.satuan_beli', 'left')
            ->select('kode_barang')
            ->select('nama_barang')
            ->select('stok')
            ->select('stok_minimum')
            ->select('satuan_barang_id AS satuan_beli_id')
            ->select('satuan_barang_name AS satuan_beli')
            ->select('harga_beli')
            ->select('harga_jual')
            ->findAll();

SELECT *
FROM `tbl_satuan_barang`
SELECT *
FROM `tbl_supplier`
ORDER BY `updated_at` ASC
SELECT *
FROM `tbl_barang`
WHERE `stok` < stok_minimum
ORDER BY `kode_barang` ASC
---
            }
        }

        $satuan_barang = $this->satuanBarangModel->findAll();
        return view('pesanan/pesanan_add', [
            'title' => 'Tambah Pengajuan Barang',
            'navLink' => 'pengajuan-barang',
            'data_supplier' => $this->supplierModel->orderBy('updated_at', 'ASC')->findAll(),
            'no_pemesanan' => $no_pemesanan,
            'data_barang' => $this->barangModel->orderBy('kode_barang', 'ASC')->where('stok < stok_minimum')->findAll(),

SELECT *
FROM `tbl_permintaan`
---
    public function create()
    {
        $no_pesanan = $this->request->getVar('no_pesanan');
        $kode_supplier = $this->request->getVar('kode-supplier');
        $kode_barang = $this->request->getVar('kode_barang');
        $satuan_barang = $this->request->getVar('satuan_barang');
        $harga_beli = $this->request->getVar('harga_beli');
        $stok = $this->request->getVar('stok');
        $today = date("Y-m-d H:i:s");

        $permintaan = $this->permintaanModel->findAll();

INSERT INTO `tbl_permintaan` (`id`, `kode_pesanan`, `tanggal`, `kode_supplier`, `status`, `proses`, `total`) VALUES (1, 'P20220800001', '2022-08-11 00:13:10', '3', 'waiting', 0, 6000)
SELECT `nama_barang`
FROM `tbl_barang`
WHERE `tbl_barang`.`kode_barang` = 'BRG0008'
INSERT INTO `tbl_permintaan_detail` (`id_permintaan`, `kode_barang`, `nama_barang`, `satuan_barang_id`, `stok`, `harga_beli`) VALUES (1, 'BRG0008', 'Kopi', '4', '2', '3000')
---
                $totalBarang = $totalBarang + ($stok[$i] * $harga_beli[$i]);
            }

            $this->permintaanModel->insert([
                'id' => $id_permintaan,
                'kode_pesanan' => $no_pesanan,
                'tanggal' => $today,
                'kode_supplier' => $kode_supplier,
                'status' => 'waiting',
                'proses' => 0,
                'total' => $totalBarang
            ]);

            for ($i = 0; $i < count($kode_barang); $i++) {
                $db_barang = $this->barangModel->select('nama_barang')->find($kode_barang[$i]);

                $this->permintaanDetailModel->insert([
                    'id_permintaan' => $id_permintaan,
                    'kode_barang' => $kode_barang[$i],
                    'nama_barang' => $db_barang['nama_barang'],
                    'satuan_barang_id' => $satuan_barang[$i],
                    'stok' => $stok[$i],
                    'harga_beli' => $harga_beli[$i]
                ]);